#/*
#* Copyright (c) 2023 Christian Kierdorf
#*
#* Permission is hereby granted, free of charge, to any person obtaining a
#* copy of this software and associated documentation files (the ?Software?),
#* to deal in the Software without restriction, including without limitation
#* the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
#* sell copies of the Software, and to permit persons to whom the Software is
#* furnished to do so, subject to the following conditions:
#*
#* The above copyright notice and this permission notice shall be included in
#* all copies or substantial portions of the Software.
#*
#* THE SOFTWARE IS PROVIDED ?AS IS?, WITHOUT WARRANTY OF ANY KIND,
#* EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
#* OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
#* NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
#* HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
#* WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
#* FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
#* OTHER DEALINGS IN THE SOFTWARE.
#*
#*/
language=de
menu.PrivacyPolicy=Datenschutz
menu.Imprint=Impressum
menu.Home=Home
footer.rights=&copy; 2023 Let's Bend. Alle Rechte vorbehalten.
index.content=<h2> Let's Bend - Lerne Mundharmonika und bende wie ein Profi </h2> <p> F&uuml;r Anf&auml;nger ist das <em>Benden</em> von T&ouml;nen auf einer Mundharmonika eine gro&szlig;e H&uuml;rde. Es erfordert viel Zeit durch regelm&auml;&szlig;iges &Uuml;ben. Durch das <em>Benden</em> k&ouml;nnen auch die Halbt&ouml;ne auf der Mundharmonika durch spezielle Zieh- und Blastechniken erklingen, die durch regul&auml;res Bespielen der Kan&auml;le nicht erreichbar sind. Anf&auml;nger fragen sich, "Ist das jetzt schon Bending oder ist der Halbton exakt getroffen?" </p> <p> Die schlanke und performante App <em>Lets' Bend</em> macht es leicht und unterhaltsam f&uuml;r jeden, die Kunst des Bendens zu meistern. Durch Visualisierung der gespielten Noten wirst Du in kurzer Zeit wie ein Profi benden. </p> <p> Ein kurzes Video &uuml;ber die Funktionalit&auml;t ist auf Youtube ver&ouml;ffentlicht:</p> <div class="video-container"> <iframe allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen class="video" height="315" loading="lazy" src="https://www.youtube-nocookie.com/embed/VNuPTUcXYV4" title="YouTube video player" frameborder="0" width="560"></iframe> </div> <p> Die urspr&uuml;ngliche Idee bei der Entwicklung der App <em>Let's Bend</em> war es, eine Anwendung zu erschaffen, die auf allen g&auml;ngigen Betriebssystemen verf&uuml;gbar ist und deren Anwendungsfenster gut skaliert. Nicht selten hat man beim &Uuml;ben noch weitere Anwendungen ge&ouml;ffnet oder m&ouml;chte auf unterschiedlichen Ger&auml;ten das Programm nutzen. Nicht zuletzt sollten alle Tonarten und die g&auml;ngigsten Sonderstimmungen von Mundharmonikas unterst&uuml;tzt werden. </p> <p> Im Ergebnis gibt es nun zwei Versionen der App. Eine Desktop-Version f&uuml;r die Betriebssysteme macOS, Debian und Windows, sowie eine Android-Variante f&uuml;r mobile Ger&auml;te. </p> <p> Die Android-Version ist kosten- und werbefrei auf <a href="https://play.google.com/store/apps/details?id=de.schliweb.bluesharpbendingapp&hl=de">Google Play</a> und <a href="https://www.amazon.de/Christian-Kierdorf-Lets-Bend/dp/B0C96X2KRG">Amazon</a> ver&ouml;ffentlicht. </p> <p> Da eine Ver&ouml;ffentlichung auf Microsoft Store und Apple App Store mit zus&auml;tzlichen Entwicklungskosten verbunden ist, die den finanziellen Aufwand eines Hobby-Entwicklungsprojekts &uuml;bersteigen, wurde die Desktop-Version dort nicht ver&ouml;ffentlicht. Stattdessen gibt es <a href="/download.html">hier eine alternative Downloadm&ouml;glichkeit der Desktop-Variante.</a> </p><p> Der Quellcode der Anwendungen ist <a href="https://github.com/egdels/bluesharpbendingapp">hier</a> ver&ouml;ffentlicht. </p><p> Wenn Du den Entwickler von <em>Let's Bend</em> durch eine freiwillige Spende unterst&uuml;tzen m&ouml;chtest, gibt es in der Desktop-Version eine <em>Buy me a coffee</em>-Funktion. Aber auch hier bleibt <em>Let's Bend</em> grunds&auml;tzlich kostenlos. </p> <p> Doch nun genug Gerede. <em>Let's Bend!</em></p>
index.title=Let's Bend
impressum.content=<h2> Impressum </h2> <p> Verantwortlich f&uuml;r diese Webseite ist: </p> <address> Christian Kierdorf<br/> Gringsstra&szlig;e 25<br/> 53177 Bonn<br/> Deutschland<br/> <span class="rtl">ed.bewilhcs@frodreik.naitsirhc</span> </address> <p>Yassine Chakri hat dankenswerterweise das Layout der Webseite erstellt und die Datenschutzerkl&auml;rung der Android App ins Englische &uuml;bersetzt. Ihm geb&uuml;hrt daf&uuml;r ein herzliches Dankesch&ouml;n ;-)</p> <p>Das Logo der Webseite basiert auf einer Arbeit von paulgillings76 auf pixabay.com</p> <p>Die Texte auf dieser Webseite wurden teilweise mithilfe des Sprachmodells Vicuna erstellt.</p> <p>F&uuml;r die &Uuml;bersetzungen der Webseitentexte wurde DeepL verwendet.</p>
datenschutz.content=<h2> Datenschutzerkl&auml;rung dieser Webseite </h2> <p> Dies ist die Datenschutzerkl&auml;rung der Webseite <em>letsbend.de</em></p> <p> Verantwortlich f&uuml;r den Datenschutz dieser Webseite ist: </p> <address> Christian Kierdorf<br/> Gringsstra&szlig;e 25<br/> 53177 Bonn<br/> Deutschland<br/> <span class="rtl">ed.bewilhcs@frodreik.naitsirhc</span> </address> <p> Zur Gew&auml;hrung eines sicheren Betriebs dieser Webseite werden Zugriffe in einem sogenannten Access-log protokolliert. Es werden folgende Parameter erhoben: </p> <ul> <li>Browsertyp und -version,</li> <li>verwendetes Betriebssystem,</li> <li>Datum und Uhrzeit des Abrufs (Zeitstempel),</li> <li>Anfrage und Zieladresse (Protokollversion, HTTP-Methode, Referrer, User Agent-String)</li> <li>Name der abgerufenen Datei und &uuml;bertragene Dateimenge (angefragte URL inklusive Query-String, Gr&ouml;&szlig;e in Byte) </li> <li>Meldung, ob der Abruf erfolgreich war (HTTP Status Code)</li> </ul> <p> Eine Speicherung der IP-Adresse des Webseitennutzers erfolgt nicht. Das Access-log wird sp&auml;testens nach Ablauf von 24 Stunden gel&ouml;scht. Eine Weitergabe der erhobenen Daten an Dritte oder eine andere Verwendung, als die zum sicheren Betrieb dieser Webseite, erfolgt nicht. </p> <p> Die Webseite wird auf Servern von Host Europe gehosted. Durch das Hosting k&ouml;nnen personenbezogene Daten anfallen, deren Verarbeitung nicht im Einflussbereich des Verantwortlichen dieser Webseite liegen. Dazu beachte bitte die <a href="https://www.hosteurope.de/AGB/Datenschutzerklaerung/">Datenschutzerkl&auml;rung von Host Europe.</a> </p> <p> Zur Veranschaulichung sind auf der Webseite Youtube-Videos eingebunden. Die Einbindung erfolgt mit der Option <em>Datenschutz Modus</em> aktiviert. Youtube schreibt dazu, es "werden von YouTube keine Informationen &uuml;ber die Besucher auf deiner Website gespeichert, es sei denn, sie sehen sich das Video an." Es liegt nicht im Einflussbereich des Verantwortlichen dieser Webseite, in welchem Umfang Youtube personenbezogene Daten beim Betrachten von Youtube-Videos auf dieser Webseite verarbeitet. Dazu beachte bitte die <a href="https://policies.google.com/privacy?hl=de">Datenschutzerkl&auml;rung von Youtube</a>. </p> <p> Diese Erkl&auml;rung wurde am 30.06.2023 erstellt und ist <a href="https://www.letsbend.de/datenschutz.html#datenschutz">hier</a> ver&ouml;ffentlicht. </p>
android.PrivacyPolicy=<h2> Datenschutzerkl&auml;rung Android-App </h2> <p> Dies ist die Datenschutzerkl&auml;rung f&uuml;r die Android-Version <em>Let's Bend</em> der BluesHarpBendingApp, die auf Google-Playstore und Amazon Appstore ver&ouml;ffentlicht ist. Ziel dieser Anwendung ist es, Mundharmonika-Spieler beim richtigen Treffen von T&ouml;nen zu unterst&uuml;tzen. </p> <p> Let's Bend wurde als Hobby-Projekt entwickelt von: </p> <address> Christian Kierdorf<br/> Gringsstra&szlig;e 25<br/> 53177 Bonn<br/> Deutschland<br/> </address> <p> Bei Fragen zu dieser Erkl&auml;rung kannst Du dem Entwickler eine E-Mail senden: <span class="rtl">ed.bewilhcs@frodreik.naitsirhc</span> </p> <p> Die Anwendung ist werbefrei und ohne individuelle Anmeldung frei zu verwenden. Zur Nutzung der Anwendung wird Zugriff auf das Mikrofon des Ger&auml;ts ben&ouml;tigt, auf dem die Anwendung installiert ist. Es kann nicht ausgeschlossen werden, dass w&auml;hrend der Nutzung der Anwendung neben den Ger&auml;uschen der Mundharmonika auch personenbezogene Daten in Form von Ger&auml;uschen anfallen. Diese Ger&auml;usche werden durch die Anwendung genauso wie Ger&auml;usche der Mundharmonika behandelt und nicht gesondert ausgewertet. </p> <p> Ger&auml;usche werden &uuml;ber die Standard-Bibliothek <a href="https://developer.android.com/reference/android/media/MediaRecorder">MediaRecorder</a> als kontinuierlicher Datenstrom ausgelesen, mittels mathematischer Methoden in T&ouml;ne umgerechnet und zur Anzeige gebracht. Der Datenstrom wird weder in Dateiform auf dem Ger&auml;t dauerhaft gespeichert noch an Dritte zur weiteren Verarbeitung weitergeleitet. Die Daten bleiben ausschlie&szlig;lich auf dem Ger&auml;t f&uuml;r die Dauer, die f&uuml;r die Umrechnung des Datenstroms in T&ouml;ne erforderlich ist. </p> <p> Du kannst die Berechtigung zur Verwendung des Mikrofons &uuml;ber die Systemeinstellungen des Ger&auml;ts jederzeit widerrufen. </p> <p> Neben Ger&auml;uschen werden durch die Anwendung keine weiteren personenbezogenen Daten verarbeitet. </p> <p> Durch die Installation und Nutzung von <em>Let's Bend</em> &uuml;ber Google-Playstore und Amazon Appstore k&ouml;nnen weitere personenbezogene Daten anfallen, deren Verarbeitung nicht im Einflussbereich des Entwicklers liegen. Dazu beachte bitte die <a href="https://policies.google.com/privacy?hl=de">Datenschutzerkl&auml;rung von Google-Playstore</a> und <a href="https://www.amazon.de/gp/help/customer/display.html?nodeId=GX7NJQ4ZB8MHFRNJ">Datenschutzerkl&auml;rung von Amazon Appstore</a>. </p> <p> Diese Erkl&auml;rung wurde am 09.06.2023 erstellt und ist <a href="https://www.letsbend.de/datenschutz.html#datenschutz_android">hier</a> ver&ouml;ffentlicht. </p>
error.title=Let's Bend - Oops
error.content=<h2> Oops </h2> <p>Etwas ist schief gelaufen!</p>
download.content=<h2> Download </h2> <p> Index von /download/ </p>
download.content2=<p> Index von /download/olderVersions </p>
download.downloadTable.fileName=Dateiname
download.downloadTable.fileSize=Dateigr&ouml;&szlig;e
download.downloadTable.fileDate=Datum